tutorials/multiphase/reactingMultiphaseEulerFoam/laminar/biomassPyrolsis/fluidizedBedMillerBellan/constant/chemistryProperties.air
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistryType
{
    solver            ode;
}

chemistry           on;

initialChemicalTimeStep 1e-07;

odeCoeffs
{
    solver          seulex;//Rosenbrock34;
    absTol          1e-12;
    relTol          1e-4;
}

EulerImplicitCoeffs
{
    cTauChem        1;
    equilibriumRateLimiter off;
}

#include "reactions.air"

// ************************************************************************* //
