tutorials/multiphase/reactingMultiphaseEulerFoam/laminar/biomassPyrolsis/fluidizedBedMillerBellan/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.*"
    {
        nAlphaCorr      3;
        nAlphaSubCycles 1;
        implicitPhasePressure yes;
        solver          GAMG;
	    smoother        DIC;
        tolerance       1e-12;
        relTol          0;
        minIter         3;
    }

    p_rgh
    {
        solver          PBiCGStab;
	    preconditioner  DIC;
        tolerance       1e-10;
        relTol          0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    "U.*"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0;
        minIter         1;
    }

    "(e|h).*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
        minIter         1;
        //maxIter         100;
    }

    "Theta.*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
        minIter         1;
    }

    "(k|epsilon).*"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
        minIter         1;
    }

    "Yi.*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-10;
        relTol          0;
        minIter         1;
        residualAlpha   1e-8;
    }
}

PIMPLE
{
    nOuterCorrectors 20;
    nCorrectors      2;
    nNonOrthogonalCorrectors 0;
    nEnergyCorrectors   2;
    faceMomentum        yes;

    outerCorrectorResidualControl
    {
        p_rgh
        {
            tolerance        1e-4;
            relTol              0;
        }

        alpha.air
        {
            tolerance  1e-4;
            relTol     0 ;
        }

        "(h|e).*"
        {
            tolerance       1e-4;
            relTol          0.1;
        }

        "U.*"
        {
            tolerance       1e-3;
            relTol          0.1;
        }

        "Theta.*"
        {
            tolerance       1e-4;
            relTol          0;
        }

        "Yi.*"
        {
            tolerance       1e-3;
            relTol          0.1;
        }
    }
}

relaxationFactors
{
    fields
    {
        iDmdt     0.1;
        p_rgh     0.3;
    }

    equations
    {
        ".*"            1;
        "U.*"           0.5;
        "(h|e).*"       0.1;
        "iDmt.*"        0.2;
        "Yi.*"          0.1;
        "k.*"           0.1;
        "epsilon.*"     0.5;
    }
}


// ************************************************************************* //
