tutorials/multiphase/reactingMultiphaseEulerFoam/laminar/biomassPyrolsis/fluidizedBedMillerBellan/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.air 1
    volScalarFieldValue alpha.particles1 0
    volScalarFieldValue alpha.particles2 0
    volScalarFieldValue cellulose.particles2  0
    volScalarFieldValue char.particles2  0
);

regions
(
    boxToCell
    {
        box (-0.15 0 -1) (0.15 0.10414 1);

        fieldValues
        (
            volScalarFieldValue alpha.air 0.41
            volScalarFieldValue alpha.particles1    0.59
            volScalarFieldValue cellulose.particles2  0.40
            volScalarFieldValue hemicellulose.particles2  0.38
            volScalarFieldValue lignin.particles2  0.22
            volScalarFieldValue char.particles2  0
        );
    }
);


// ************************************************************************* //
